def count_pairs(filename, pairs):                              # функція рахує біграми (пари букв) у файлі
    try:
        with open(filename, 'r', encoding='utf-8') as f:      # відкриваємо файл у режимі читання
            for line in f:                                    # читаємо кожен рядок файлу
                
                pairs_list = {}                               # словник для підрахунку пар

                for pair in pairs:                            # проходимо по списку пар
                    pairs_list[pair] = 0                      # ініціалізуємо кожну пару значенням 0

                words = line.lower().split()                  # переводимо рядок у нижній регістр і розбиваємо на слова

                for word in words:                            # проходимо по кожному слову
                    for i in range(len(word) - 1):            # перебираємо індекси для вилучення пар букв
                        current_pair = word[i:i+2]            # формуємо пару (біграму)
                        if current_pair in pairs_list:        # якщо ця пара нам потрібна
                            pairs_list[current_pair] += 1     # збільшуємо лічильник

                yield pairs_list                               # повертаємо результат для поточного рядка

    except Exception as e:                                     # ловимо всі можливі помилки
        print(f"Помилка при читанні файлу: {e}")               # виводимо текст помилки
        return                                                 # завершуємо функцію


def main():                                                    # головна функція програми
    FILE = "text.txt"                                          # ім'я файлу для обробки
    PAIRS = ['su', 'on', 'ps']                                 # пари букв, які треба шукати
    result = count_pairs(FILE, PAIRS)                          # викликаємо генератор, що рахує пари
    i = 1                                                      # лічильник рядків

    for res in result:                                         # перебираємо результати з генератора
        print(f"Рядок №{i}: {res}")                            # виводимо словник з підрахунком
        i += 1                                                 # переходимо до наступного номера рядка


if __name__ == "__main__":                                     # запускаємо main, якщо файл запущено напряму
    main()                                                     # викликаємо головну функцію
